In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

import warnings
warnings.filterwarnings(action='ignore')

In [2]:
dict1 = {'Name': ['Priyang Bhatt', 'Rashmin Panchal', 'Anil Rana', 'Rahul Patel'],
        'City': [' New York ', ' Los Angeles ', ' Chicago', ' Houston'],
        'State': ['NY', 'CA', 'IL', 'TX']}
data = pd.DataFrame(dict1)

In [3]:
data

              Name           City State
0    Priyang Bhatt      New York     NY
1  Rashmin Panchal   Los Angeles     CA
2        Anil Rana        Chicago    IL
3      Rahul Patel        Houston    TX

### str.lower()

In [4]:
data['name_lower'] = data['Name'].str.lower()

In [5]:
data

              Name           City State       name_lower
0    Priyang Bhatt      New York     NY    priyang bhatt
1  Rashmin Panchal   Los Angeles     CA  rashmin panchal
2        Anil Rana        Chicago    IL        anil rana
3      Rahul Patel        Houston    TX      rahul patel

In [6]:
data['name_upper'] = data['Name'].str.upper()

In [7]:
data

              Name           City State       name_lower       name_upper
0    Priyang Bhatt      New York     NY    priyang bhatt    PRIYANG BHATT
1  Rashmin Panchal   Los Angeles     CA  rashmin panchal  RASHMIN PANCHAL
2        Anil Rana        Chicago    IL        anil rana        ANIL RANA
3      Rahul Patel        Houston    TX      rahul patel      RAHUL PATEL

### str.len()

In [8]:
data['Name'].str.len()

0    13
1    15
2     9
3    11
Name: Name, dtype: int64

In [9]:
data['Name_len'] = data['Name'].str.len()
data

,Name,City,State,name_lower,name_upper,Name_len
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11

### str.strip()----to remove white spaces from beginning to end

In [10]:
data['City'][0]

' New York '

In [11]:
data['City_strip'] = data['City'].str.strip()

In [12]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston

In [13]:
data['City_strip'][0]

'New York'

In [14]:
# to remove left white spaces & right white spaces separately

data['City'][0]

' New York '

In [15]:
data['City_lstrip'] = data['City'].str.lstrip()

In [16]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,City_lstrip
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston

In [17]:
data['City_lstrip'][0]

'New York '

In [18]:
data['City_rstrip'] = data['City'].str.rstrip()

In [19]:
data['City_rstrip'][0]

' New York'

### str.split()----to split the string

In [20]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,City_lstrip,City_rstrip
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston

In [21]:
# expand = True, the result will be written in the dataframe, one column for each substring

data[['first_name', 'second_name']] = data['Name'].str.split(' ', expand=True)

In [22]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,City_lstrip,City_rstrip,first_name,second_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel

### str.contains()----to check substring

In [23]:
data[data['Name'].str.contains('Bhatt')]

,Name,City,State,name_lower,name_upper,Name_len,City_strip,City_lstrip,City_rstrip,first_name,second_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt

### str.replace()---to replace the string

In [24]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,City_lstrip,City_rstrip,first_name,second_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel

In [25]:
data['State'].str.replace('NY', 'New York')

0    New York
1          CA
2          IL
3          TX
Name: State, dtype: object

In [26]:
data['State_replace'] = data['State'].str.replace('NY', 'New York')

In [27]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,City_lstrip,City_rstrip,first_name,second_name,State_replace
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,CA
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX

In [28]:
# we can replace with chian format also

data['State_replace'] = data['State'].str.replace('NY', 'New York').str.replace('CA', 'Los Angeles')

In [29]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,City_lstrip,City_rstrip,first_name,second_name,State_replace
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,Los Angeles
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX

### str.startswith()

In [31]:
data[data['first_name'].str.startswith('P')]

,Name,City,State,name_lower,name_upper,Name_len,City_strip,City_lstrip,City_rstrip,first_name,second_name,State_replace
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York

In [33]:
data['ends_with_l'] = data['second_name'].str.endswith('l')

In [34]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,City_lstrip,City_rstrip,first_name,second_name,State_replace,ends_with_l
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York,False
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,Los Angeles,True
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL,False
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX,True

In [35]:
data[data['second_name'].str.endswith('l')]

,Name,City,State,name_lower,name_upper,Name_len,City_strip,City_lstrip,City_rstrip,first_name,second_name,State_replace,ends_with_l
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,Los Angeles,True
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX,True

### str.cat()---used to concatenate strings

In [37]:
data['first_name'].str.cat(data['second_name'], sep=' ')

0      Priyang Bhatt
1    Rashmin Panchal
2          Anil Rana
3        Rahul Patel
Name: first_name, dtype: object

In [38]:
data['full_name'] = data['first_name'].str.cat(data['second_name'], sep=' ')

In [39]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,City_lstrip,City_rstrip,first_name,second_name,State_replace,ends_with_l,full_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York,False,Priyang Bhatt
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,Los Angeles,True,Rashmin Panchal
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL,False,Anil Rana
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX,True,Rahul Patel

### str.get()----to extract elements based on index

In [40]:
data['Name'].str.get(0)

0    P
1    R
2    A
3    R
Name: Name, dtype: object

In [41]:
data['Name'].str.get(-1)

0    t
1    l
2    a
3    l
Name: Name, dtype: object

In [42]:
data['Name'].str.split()

0      [Priyang, Bhatt]
1    [Rashmin, Panchal]
2          [Anil, Rana]
3        [Rahul, Patel]
Name: Name, dtype: object

In [43]:
data['Name'].str.split().str.get(0)

0    Priyang
1    Rashmin
2       Anil
3      Rahul
Name: Name, dtype: object

In [44]:
data['Name'].str.split().str.get(-1)

0      Bhatt
1    Panchal
2       Rana
3      Patel
Name: Name, dtype: object

### str.slice()---to extract substring

In [45]:
data['Name'].str.slice(-3)

0    att
1    hal
2    ana
3    tel
Name: Name, dtype: object

In [46]:
data['Name'].str.slice(0,3)

0    Pri
1    Ras
2    Ani
3    Rah
Name: Name, dtype: object

In [47]:
data['name_state'] = data['Name'].str.slice(0,3)+' '+data['State']

In [48]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,City_lstrip,City_rstrip,first_name,second_name,State_replace,ends_with_l,full_name,name_state
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York,False,Priyang Bhatt,Pri NY
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,Los Angeles,True,Rashmin Panchal,Ras CA
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL,False,Anil Rana,Ani IL
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX,True,Rahul Patel,Rah TX

### str.find()----return 1st index position of substring, if the string is not found it returns -1

In [49]:
data['Name']

0      Priyang Bhatt
1    Rashmin Panchal
2          Anil Rana
3        Rahul Patel
Name: Name, dtype: object

In [50]:
data['Name'].str.find('i')

0    2
1    5
2    2
3   -1
Name: Name, dtype: int64

### str.rfind()---returns highest index position of substring

In [51]:
data['Name'].str.rfind('a')

0    10
1    13
2     8
3     7
Name: Name, dtype: int64